# Continuing Pandas dataframes
- selecting
- dropping
- adding
- changing elements

In [2]:
import pandas as pd
import numpy as np

In [4]:
pres = pd.read_csv('president_heights.csv')

In [6]:
pres.head()

   order               name  height(cm)
0      1  George Washington         189
1      2         John Adams         170
2      3   Thomas Jefferson         189
3      4      James Madison         163
4      5       James Monroe         183

In [7]:
pres.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 44 entries, 0 to 43
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   order       44 non-null     int64
 1   name        44 non-null     object
 2   height(cm)  44 non-null     int64
dtypes: int64(2), object(1)
memory usage: 1.2+ KB

In [9]:
pres.dtypes

order          int64
name          object
height(cm)     int64
dtype: object

In [11]:
# Get the column name
pres['name'].head()

0    George Washington
1           John Adams
2     Thomas Jefferson
3        James Madison
4         James Monroe
Name: name, dtype: object

In [14]:
# Error because there is no column 4
# pres[4]

In [16]:
# get list of columns
list(pres.columns)

['order', 'name', 'height(cm)']

In [17]:
# return the length of the tuple
pres.shape

(44, 3)

In [18]:
# return the numeric columns, count, mean, std, min, etc...
# 25%, 50%, 75% percentile
pres.describe()

           order  height(cm)
count  44.000000   44.000000
mean   23.522727  180.068182
std    13.729087    7.072376
min     1.000000  163.000000
25%    11.750000  174.750000
50%    24.000000  182.000000
75%    35.250000  183.500000
max    46.000000  193.000000

In [19]:
# adding a column into dataframe and convert cm to inches
pres['height(in)'] = pres['height(cm)'] /2.54

In [23]:
pres.describe()

           order  height(cm)  height(in)
count  44.000000   44.000000   44.000000
mean   23.522727  180.068182   70.892985
std    13.729087    7.072376    2.784400
min     1.000000  163.000000   64.173228
25%    11.750000  174.750000   68.799213
50%    24.000000  182.000000   71.653543
75%    35.250000  183.500000   72.244094
max    46.000000  193.000000   75.984252

In [24]:
# standard deviation 
pres['height(cm)'].std()

7.0723757636962095

In [27]:
len(pres)

44

In [28]:
type(pres)

pandas.core.frame.DataFrame

In [30]:
# series, getting Thomas Jefferson
pres['name'][2]

'Thomas Jefferson'

In [35]:
# selecting from a dataframe
# short presdients!
pres[pres['height(in)'] < 67]

    order               name  height(cm)  height(in)
1       2         John Adams         170   66.929134
3       4      James Madison         163   64.173228
7       8   Martin Van Buren         168   66.141732
21     23  Benjamin Harrison         168   66.141732
22     25   William McKinley         170   66.929134

In [36]:
# to sort a series
pres['height(in)'].sort_values()

3     64.173228
21    66.141732
7     66.141732
1     66.929134
22    66.929134
5     67.322835
8     68.110236
17    68.110236
10    68.110236
11    68.110236
18    68.503937
30    68.897638
12    68.897638
36    69.685039
13    70.078740
16    70.078740
27    70.078740
23    70.078740
31    70.472441
25    70.866142
34    71.653543
28    71.653543
40    71.653543
24    71.653543
32    72.047244
35    72.047244
43    72.047244
20    72.047244
19    72.047244
14    72.047244
9     72.047244
26    72.047244
4     72.047244
6     72.834646
41    72.834646
37    72.834646
29    74.015748
38    74.015748
39    74.015748
2     74.409449
0     74.409449
42    75.196850
15    75.984252
33    75.984252
Name: height(in), dtype: float64

In [43]:
# sort presidents by name values, inplace modifies the dataframe
pres.sort_values(by = 'name', inplace= True)

In [44]:
pres

    order                    name  height(cm)  height(in)
15     16         Abraham Lincoln         193   75.984252
6       7          Andrew Jackson         185   72.834646
16     17          Andrew Johnson         178   70.078740
41     44            Barack Obama         185   72.834646
21     23       Benjamin Harrison         168   66.141732
39     42            Bill Clinton         188   74.015748
27     30         Calvin Coolidge         178   70.078740
20     21       Chester A. Arthur         183   72.047244
42     45            Donald Trump         191   75.196850
31     34    Dwight D. Eisenhower         179   70.472441
29     32   Franklin D. Roosevelt         188   74.015748
13     14         Franklin Pierce         178   70.078740
38     41       George H. W. Bush         188   74.015748
40     43          George W. Bush         182   71.653543
0       1       George Washington         189   74.409449
35     38             Gerald Ford         183   72.047244
30     33         Harry S. Truman         175   68.897638
28     31          Herbert Hoover         182   71.653543
19     20       James A. Garfield         183   72.047244
14     15          James Buchanan         183   72.047244
10     11           James K. Polk         173   68.110236
3       4           James Madison         163   64.173228
4       5            James Monroe         183   72.047244
36     39            Jimmy Carter         177   69.685039
1       2              John Adams         170   66.929134
32     35         John F. Kennedy         183   72.047244
5       6       John Quincy Adams         171   67.322835
9      10              John Tyler         183   72.047244
43     46            Joseph Biden         183   72.047244
33     36       Lyndon B. Johnson         193   75.984252
7       8        Martin Van Buren         168   66.141732
12     13        Millard Fillmore         175   68.897638
34     37           Richard Nixon         182   71.653543
37     40           Ronald Reagan         185   72.834646
18     19     Rutherford B. Hayes         174   68.503937
23     26      Theodore Roosevelt         178   70.078740
2       3        Thomas Jefferson         189   74.409449
17     18        Ulysses S. Grant         173   68.110236
26     29       Warren G. Harding         183   72.047244
8       9  William Henry Harrison         173   68.110236
24     27     William Howard Taft         182   71.653543
22     25        William McKinley         170   66.929134
25     28          Woodrow Wilson         180   70.866142
11     12          Zachary Taylor         173   68.110236

In [49]:
pres.sort_values(by='order',inplace=True)
pres.head()

   order               name  height(cm)  height(in)
0      1  George Washington         189   74.409449
1      2         John Adams         170   66.929134
2      3   Thomas Jefferson         189   74.409449
3      4      James Madison         163   64.173228
4      5       James Monroe         183   72.047244

In [50]:
# selecting a row
# loc and iloc

In [51]:
area = pd.Series({'California': 423967, 'Texas': 695662,
                  'New York': 141297, 'Florida': 170312,
                  'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                 'New York': 19651127, 'Florida': 19552860,
                 'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [53]:
# get the row
# loc uses the row label to select the row
data.loc['California']

area      423967
pop     38332521
Name: California, dtype: int64

In [54]:
# get the row
# iloc get the row using the index location
data.iloc[0]

area      423967
pop     38332521
Name: California, dtype: int64

In [56]:
# get the list of rows and only column 'area'
data.loc[['California', 'New York'], 'area']

California    423967
New York      141297
Name: area, dtype: int64

In [57]:
# getting list of row using index location
data.iloc[[0,2]]

              area       pop
California  423967  38332521
New York    141297  19651127

In [58]:
# splicing from 0 to 2
data.iloc[0:2]

              area       pop
California  423967  38332521
Texas       695662  26448193

In [60]:
# getting list of rows and getting only area column
data.loc['California':'New York', 'area']

California    423967
Texas         695662
New York      141297
Name: area, dtype: int64

In [61]:
# get everything cause your splicing beginning to the end
data.loc[:]

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [64]:
# splicing New York to the end
# only pop column
data.loc['New York':, 'pop':]

               pop
New York  19651127
Florida   19552860
Illinois  12882135

In [66]:
# conditional with loc, getting area that is greater than 400000
data.loc[data['area'] > 400000]

              area       pop
California  423967  38332521
Texas       695662  26448193

In [67]:
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [68]:
# return rows that are only true
data.loc[[True, True, False, True, True]]

              area       pop
California  423967  38332521
Texas       695662  26448193
Florida     170312  19552860
Illinois    149995  12882135

In [75]:
# list all presidents that are taller than average
# mean = average
pres[pres['height(in)'] > pres['height(in)'].mean()]

    order                   name  height(cm)  height(in)
0       1      George Washington         189   74.409449
2       3       Thomas Jefferson         189   74.409449
4       5           James Monroe         183   72.047244
6       7         Andrew Jackson         185   72.834646
9      10             John Tyler         183   72.047244
14     15         James Buchanan         183   72.047244
15     16        Abraham Lincoln         193   75.984252
19     20      James A. Garfield         183   72.047244
20     21      Chester A. Arthur         183   72.047244
24     27    William Howard Taft         182   71.653543
26     29      Warren G. Harding         183   72.047244
28     31         Herbert Hoover         182   71.653543
29     32  Franklin D. Roosevelt         188   74.015748
32     35        John F. Kennedy         183   72.047244
33     36      Lyndon B. Johnson         193   75.984252
34     37          Richard Nixon         182   71.653543
35     38            Gerald Ford         183   72.047244
37     40          Ronald Reagan         185   72.834646
38     41      George H. W. Bush         188   74.015748
39     42           Bill Clinton         188   74.015748
40     43         George W. Bush         182   71.653543
41     44           Barack Obama         185   72.834646
42     45           Donald Trump         191   75.196850
43     46           Joseph Biden         183   72.047244

In [76]:
avg = pres['height(in)'].mean()
pres[pres['height(in)'] > avg]

    order                   name  height(cm)  height(in)
0       1      George Washington         189   74.409449
2       3       Thomas Jefferson         189   74.409449
4       5           James Monroe         183   72.047244
6       7         Andrew Jackson         185   72.834646
9      10             John Tyler         183   72.047244
14     15         James Buchanan         183   72.047244
15     16        Abraham Lincoln         193   75.984252
19     20      James A. Garfield         183   72.047244
20     21      Chester A. Arthur         183   72.047244
24     27    William Howard Taft         182   71.653543
26     29      Warren G. Harding         183   72.047244
28     31         Herbert Hoover         182   71.653543
29     32  Franklin D. Roosevelt         188   74.015748
32     35        John F. Kennedy         183   72.047244
33     36      Lyndon B. Johnson         193   75.984252
34     37          Richard Nixon         182   71.653543
35     38            Gerald Ford         183   72.047244
37     40          Ronald Reagan         185   72.834646
38     41      George H. W. Bush         188   74.015748
39     42           Bill Clinton         188   74.015748
40     43         George W. Bush         182   71.653543
41     44           Barack Obama         185   72.834646
42     45           Donald Trump         191   75.196850
43     46           Joseph Biden         183   72.047244

In [77]:
len(pres[pres['height(in)'] > pres['height(in)'].mean()])

24

In [81]:
# Dropping rows and columns from a dataframe using drop(value)
# drop Texas row
# data.drop('Texas')
# drop texas and florida
data.drop(['Texas', 'Florida'])

              area       pop
California  423967  38332521
New York    141297  19651127
Illinois    149995  12882135

In [82]:
# drop column area .drop('value', axis=1)
data.drop('area', axis = 1)

                 pop
California  38332521
Texas       26448193
New York    19651127
Florida     19552860
Illinois    12882135

In [84]:
# return the row labels
data.loc[data['area'] > 400000].index

Index(['California', 'Texas'], dtype='object')

In [85]:
# dropping labels of rows
data.drop(data.loc[data['area'] > 400000].index)

            area       pop
New York  141297  19651127
Florida   170312  19552860
Illinois  149995  12882135

In [86]:
pres.head()

   order               name  height(cm)  height(in)
0      1  George Washington         189   74.409449
1      2         John Adams         170   66.929134
2      3   Thomas Jefferson         189   74.409449
3      4      James Madison         163   64.173228
4      5       James Monroe         183   72.047244

In [87]:
# Changing value based on label .loc[row, column]
pres.loc[2, 'name'] = 'Junk'

In [88]:
pres.head()

   order               name  height(cm)  height(in)
0      1  George Washington         189   74.409449
1      2         John Adams         170   66.929134
2      3               Junk         189   74.409449
3      4      James Madison         163   64.173228
4      5       James Monroe         183   72.047244

In [89]:
tall_names = pres.loc[pres['height(cm)'] > 188, 'name']

In [90]:
tall_names

0     George Washington
2                  Junk
15      Abraham Lincoln
33    Lyndon B. Johnson
42         Donald Trump
Name: name, dtype: object

In [91]:
tall_names[0] = 'New Junk'

In [92]:
tall_names

0              New Junk
2                  Junk
15      Abraham Lincoln
33    Lyndon B. Johnson
42         Donald Trump
Name: name, dtype: object

In [95]:
short_names = pres[pres['height(cm)'] < 170]['name']

In [96]:
short_names

3         James Madison
7      Martin Van Buren
21    Benjamin Harrison
Name: name, dtype: object

In [97]:
# Warning!!! A value is trying to be set on a copy of a slice from a dataframe
short_names[3] = 'Newer Junk'

C:\Users\Gary\AppData\Local\Temp/ipykernel_13368/3697914425.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  short_names[3] = 'Newer Junk'

In [98]:
# Does modified
short_names

3            Newer Junk
7      Martin Van Buren
21    Benjamin Harrison
Name: name, dtype: object

In [99]:
# check if it is a view or not
short_names._is_view

True

In [100]:
# tall_names not a view
tall_names._is_view

False

In [102]:
# making a copy using .copy
short_names = pres[pres['height(cm)'] < 170].copy()['name']